var lang = document.documentElement.lang;

var en = document.getElementById("en");
var ipa_uk = document.getElementById("ipa_uk");
var ipa_us = document.getElementById("ipa_us");
var ipa_mix = document.getElementById("ipa_mix");
var common = document.getElementById("common");
var katakana = document.getElementById("katakana");
var hiragana = document.getElementById("hiragana");
var error = document.getElementById("error");
var ipa_common = [
	["ɡ", "g"], ["θ", "þ"], ["ʃ", "ŝ"], ["ʒ", "ĵ"], ["ʧ", "ĉ"], ["ʤ", "ĝ"],
	["ts", "ċ"], ["dz", "d̂"], ["j", "y"],
	["aʊ", "aw"], ["eɪ", "ey"], ["aɪ", "ay"], ["əʊ", "ow"], ["ɔɪ", "oy"],
	["i(?!ː)", "iː"], ["u(?!ː)", "uː"], ["ɑ(?!ː)", "aː"], ["ɔ(?!ː)", "oː"],
	["ɑ", "a"], ["ɛ", "e"], ["ɪ", "i"], ["[ɒɔ]", "o"], ["ʊ", "u"], ["ʌ", "ə"]
];
var common_kana = [
	["! ?", "！"], ["\\? ?", "？"], [", ?", "，"], ["\\. ?", "。"],
	[" ?“", "「"], ["” ?", "」"], [" ?‘", "『"], ["’ ?", "』"],
	["(?<=\\p{L})[-‐](?=\\p{L})", "・"], ["(?<=\\p{L})[=⹀]|[=⹀](?=\\p{L})", "゠"],
	["ə", "a"], ["ː", "ー"]
];
var common_katakana = [
	["æ", "eァ"],
	["ka", "カ"], ["ki", "キ"], ["ku", "ク"], ["ke", "ケ"], ["ko", "コ"], ["ky", "キʲ"], ["kw", "クʷ"], ["k", "ㇰ"],
	["ga", "ガ"], ["gi", "ギ"], ["gu", "グ"], ["ge", "ゲ"], ["go", "ゴ"], ["gy", "ギʲ"], ["gw", "グʷ"], ["g", "ㇰ゙"],
	["ŋa", ""], ["ŋi", ""], ["ŋu", ""], ["ŋe", ""], ["ŋo", ""], ["ŋy", "ʲ"], ["ŋw", "ʷ"], ["ŋ", "ン゚"],
	["sa", "サ"], ["si", ""], ["su", "ス"], ["se", "セ"], ["so", "ソ"], ["sy", "ʲ"], ["sw", "スʷ"], ["s", "ㇲ"],
	["za", "ザ"], ["zi", ""], ["zu", "ズ"], ["ze", "ゼ"], ["zo", "ゾ"], ["zy", "ʲ"], ["zw", "ズʷ"], ["z", "ㇲ゙"],
	["þa", ""], ["þi", ""], ["þu", ""], ["þe", ""], ["þo", ""], ["þy", "ʲ"], ["þw", "ʷ"], ["þ", "ㇲ゚"],
	["ða", ""], ["ði", ""], ["ðu", ""], ["ðe", ""], ["ðo", ""], ["ðy", "ʲ"], ["ðw", "ʷ"], ["ð", "ㇲ"],
	["ŝa", ""], ["ŝi", "シ"], ["ŝu", ""], ["ŝe", ""], ["ŝo", ""], ["ŝy", "シʲ"], ["ŝw", "ʷ"], ["ŝ", "ㇱ"],
	["ĵa", ""], ["ĵi", "ジ"], ["ĵu", ""], ["ĵe", ""], ["ĵo", ""], ["ĵy", "ジʲ"], ["ĵw", "ʷ"], ["ĵ", "ㇱ゙"],
	["ĉa", ""], ["ĉi", "チ"], ["ĉu", ""], ["ĉe", ""], ["ĉo", ""], ["ĉy", "チʲ"], ["ĉw", "ʷ"], ["ĉ", "𛅚"],
	["ĝa", ""], ["ĝi", "ヂ"], ["ĝu", ""], ["ĝe", ""], ["ĝo", ""], ["ĝy", "ヂʲ"], ["ĝw", "ʷ"], ["ĝ", "𛅚゙"],
	["ċa", ""], ["ċi", ""], ["ċu", "ツ"], ["ċe", ""], ["ċo", ""], ["ċy", "ʲ"], ["ċw", "ツʷ"], ["ċ", ""],
	["d̂a", ""], ["d̂i", ""], ["d̂u", "ヅ"], ["d̂e", ""], ["d̂o", ""], ["d̂y", "ʲ"], ["d̂w", "ヅʷ"], ["d̂", "ッ゙"],
	["ta", "タ"], ["ti", ""], ["tu", ""], ["te", "テ"], ["to", "ト"], ["ty", "ʲ"], ["tw", "ʷ"], ["t", "ㇳ"],
	["da", "ダ"], ["di", ""], ["du", ""], ["de", "デ"], ["do", "ド"], ["dy", "ʲ"], ["dw", "ʷ"], ["d", "ㇳ゙"],
	["na", "ナ"], ["ni", "ニ"], ["nu", "ヌ"], ["ne", "ネ"], ["no", "ノ"], ["ny", "ニʲ"], ["nw", "ヌʷ"], ["n", "ン"],
	["ha", "ハ"], ["hi", "ヒ"], ["hu", ""], ["he", "ヘ"], ["ho", "ホ"], ["hy", "ヒʲ"], ["hw", "ʷ"], ["h", "ㇵ"],
	["ba", "バ"], ["bi", "ビ"], ["bu", "ブ"], ["be", "ベ"], ["bo", "ボ"], ["by", "ビʲ"], ["bw", "ブʷ"], ["b", "ㇷ゙"],
	["pa", "パ"], ["pi", "ピ"], ["pu", "プ"], ["pe", "ペ"], ["po", "ポ"], ["py", "ピʲ"], ["pw", "プʷ"], ["p", ""],
	["ma", "マ"], ["mi", "ミ"], ["mu", "ム"], ["me", "メ"], ["mo", "モ"], ["my", "ミʲ"], ["mw", "ムʷ"], ["m", "ㇺ"],
	["ra", "ラ"], ["ri", "リ"], ["ru", "ル"], ["re", "レ"], ["ro", "ロ"], ["ry", "リʲ"], ["rw", "ルʷ"], ["r", ""],
	["la", ""], ["li", ""], ["lu", ""], ["le", ""], ["lo", ""], ["ly", "ʲ"], ["lw", "ʷ"], ["l", "ㇽ゚"],
	["va", "ヷ"], ["vi", "ヸ"], ["vu", ""], ["ve", "ヹ"], ["vo", "ヺ"], ["vy", "ヸʲ"], ["vw", "ʷ"], ["v", "𛅭゙"],
	["fa", ""], ["fi", ""], ["fu", ""], ["fe", ""], ["fo", ""], ["fy", "ʲ"], ["fw", "ʷ"], ["f", "𛅭゚"],
	["([yʲ])[wʷ]", "$1ʷ"], ["([wʷ])[yʲ]", "$1ʲ"],
	["ya", "ヤ"], ["yi", "𛄠"], ["yu", "ユ"], ["ye", "𛄡"], ["yo", "ヨ"],
	["wa", "ワ"], ["wi", "ヰ"], ["wu", "𛄢"], ["we", "ヱ"], ["wo", "ヲ"],
	["ʲa", "ャ"], ["ʲi", "𛅫"], ["ʲu", "ュ"], ["ʲe", "𛅬"], ["ʲo", "ョ"],
	["ʷa", "ヮ"], ["ʷi", "𛅤"], ["ʷu", "𛅭"], ["ʷe", "𛅥"], ["ʷo", "𛅦"],
	["([yʲ])", ""], ["([wʷ])", ""],
	["a", "ア"], ["i", "イ"], ["u", "ウ"], ["e", "エ"], ["o", "オ"]
];
var common_hiragana = [
	["æ", "eぁ"],
	["ka", "か"], ["ki", "き"], ["ku", "く"], ["ke", "け"], ["ko", "こ"], ["ky", "きʲ"], ["kw", "くʷ"], ["k", "𛄱"],
	["ga", "が"], ["gi", "ぎ"], ["gu", "ぐ"], ["ge", "げ"], ["go", "ご"], ["gy", "ぎʲ"], ["gw", "ぐʷ"], ["g", "𛄱゙"],
	["ŋa", ""], ["ŋi", ""], ["ŋu", ""], ["ŋe", ""], ["ŋo", ""], ["ŋy", "ʲ"], ["ŋw", "ʷ"], ["ŋ", "ん゚"],
	["sa", "さ"], ["si", ""], ["su", "す"], ["se", "せ"], ["so", "そ"], ["sy", "ʲ"], ["sw", "すʷ"], ["s", "𛄵"],
	["za", "ざ"], ["zi", ""], ["zu", "ず"], ["ze", "ぜ"], ["zo", "ぞ"], ["zy", "ʲ"], ["zw", "ずʷ"], ["z", "𛄵゙"],
	["þa", ""], ["þi", ""], ["þu", ""], ["þe", ""], ["þo", ""], ["þy", "ʲ"], ["þw", "ʷ"], ["þ", "𛄵゚"],
	["ða", ""], ["ði", ""], ["ðu", ""], ["ðe", ""], ["ðo", ""], ["ðy", "ʲ"], ["ðw", "ʷ"], ["ð", "𛄵"],
	["ŝa", "𛁃"], ["ŝi", "し"], ["ŝu", ""], ["ŝe", ""], ["ŝo", ""], ["ŝy", "しʲ"], ["ŝw", "ʷ"], ["ŝ", "𛄴"],
	["ĵa", ""], ["ĵi", "じ"], ["ĵu", ""], ["ĵe", ""], ["ĵo", ""], ["ĵy", "じʲ"], ["ĵw", "ʷ"], ["ĵ", "𛄴゙"],
	["ĉa", ""], ["ĉi", "ち"], ["ĉu", ""], ["ĉe", ""], ["ĉo", ""], ["ĉy", "ちʲ"], ["ĉw", "ʷ"], ["ĉ", "𛄹"],
	["ĝa", ""], ["ĝi", "ぢ"], ["ĝu", ""], ["ĝe", ""], ["ĝo", ""], ["ĝy", "ぢʲ"], ["ĝw", "ʷ"], ["ĝ", "𛄹゙"],
	["ċa", ""], ["ċi", ""], ["ċu", "つ"], ["ċe", ""], ["ċo", ""], ["ċy", "ʲ"], ["ċw", "つʷ"], ["ċ", ""],
	["d̂a", ""], ["d̂i", ""], ["d̂u", "づ"], ["d̂e", ""], ["d̂o", ""], ["d̂y", "ʲ"], ["d̂w", "づʷ"], ["d̂", "っ゙"],
	["ta", "た"], ["ti", ""], ["tu", "𛁭"], ["te", "て"], ["to", "と"], ["ty", "ʲ"], ["tw", "𛁭ʷ"], ["t", "𛄻"],
	["da", "だ"], ["di", ""], ["du", ""], ["de", "で"], ["do", "ど"], ["dy", "ʲ"], ["dw", "ʷ"], ["d", "𛄻゙"],
	["na", "な"], ["ni", "に"], ["nu", "ぬ"], ["ne", "ね"], ["no", "の"], ["ny", "にʲ"], ["nw", "ぬʷ"], ["n", "ん"],
	["ha", "は"], ["hi", "ひ"], ["hu", "𛀹"], ["he", "へ"], ["ho", "ほ"], ["hy", "ひʲ"], ["hw", "𛀹ʷ"], ["h", "𛅁"],
	["ba", "ば"], ["bi", "び"], ["bu", "ぶ"], ["be", "べ"], ["bo", "ぼ"], ["by", "びʲ"], ["bw", "ぶʷ"], ["b", "𛅃゙"],
	["pa", "ぱ"], ["pi", "ぴ"], ["pu", "ぷ"], ["pe", "ぺ"], ["po", "ぽ"], ["py", "ぴʲ"], ["pw", "ぷʷ"], ["p", "𛅃゚"],
	["ma", "ま"], ["mi", "み"], ["mu", "む"], ["me", "め"], ["mo", "も"], ["my", "みʲ"], ["mw", "むʷ"], ["m", "𛅈"],
	["ra", "ら"], ["ri", "り"], ["ru", "る"], ["re", "れ"], ["ro", "ろ"], ["ry", "りʲ"], ["rw", "るʷ"], ["r", ""],
	["la", ""], ["li", ""], ["lu", ""], ["le", ""], ["lo", ""], ["ly", "ʲ"], ["lw", "ʷ"], ["l", "𛅍゚"],
	["va", ""], ["vi", ""], ["vu", ""], ["ve", ""], ["vo", ""], ["vy", "ʲ"], ["vw", "ʷ"], ["v", "𛅪゙"],
	["fa", ""], ["fi", ""], ["fu", ""], ["fe", ""], ["fo", ""], ["fy", "ʲ"], ["fw", "ʷ"], ["f", "𛅪゚"],
	["([yʲ])[wʷ]", "$1ʷ"], ["([wʷ])[yʲ]", "$1ʲ"],
	["ya", "や"], ["yi", "𛀆"], ["yu", "ゆ"], ["ye", "𛀁"], ["yo", "よ"],
	["wa", "わ"], ["wi", "ゐ"], ["wu", "𛄟"], ["we", "ゑ"], ["wo", "を"],
	["ʲa", "ゃ"], ["ʲi", "𛅨"], ["ʲu", "ゅ"], ["ʲe", "𛅩"], ["ʲo", "ょ"],
	["ʷa", "ゎ"], ["ʷi", "𛅐"], ["ʷu", "𛅪"], ["ʷe", "𛅑"], ["ʷo", "𛅒"],
	["([yʲ])", ""], ["([wʷ])", ""],
	["a", "あ"], ["i", "い"], ["u", "う"], ["e", "え"], ["o", "お"]
];
document.getElementById("convert_btn").addEventListener("click", function() {
	error.textContent = "";
	var s = ipa_uk.value.trim() + "\x1e" + ipa_us.value.trim();
	s = s.replace(/['ʼˈˌ]/g, "").replace(/ᵊ/g, "ə").replace(/ɜː?/g, "əː").replace(/"(.+?)"/g, "“$1”");
	s = s.split("\x1e");
	var uk_words = s[0].split(/([\P{L}]+)/gu);
	var us_words = s[1].split(/([\P{L}]+)/gu);
	for (var i = 1; i < uk_words.length; i += 2) {
		if (uk_words[i] == "-" && us_words[i] != "-") {
			var p = us_words[i - 1].indexOf(uk_words[i + 1][0], uk_words[i - 1].replace(/ː/g, "").length);
			if (p !== -1) {
				var h_before = us_words[i - 1].slice(0, p);
				var h_after = us_words[i - 1].slice(p);
				us_words.splice(i - 1, 1, h_before, "-", h_after);
			}
		}
	}
	for (var i = 1; i < us_words.length; i += 2) {
		if (us_words[i] == "-" && uk_words[i] != "-") {
			var p = uk_words[i - 1].indexOf(us_words[i + 1][0], us_words[i - 1].length);
			if (p !== -1) {
				var h_before = uk_words[i - 1].slice(0, p);
				var h_after = uk_words[i - 1].slice(p);
				uk_words.splice(i - 1, 1, h_before, "-", h_after);
			}
		}
	}
	if (uk_words.length != us_words.length) {
		error.textContent = lang == "ja" ?
			"エラー: 単語数が 一致しません。" :
			"Error: Number of words mismatch.";
		return;
	}
	for (var i = 0; i < uk_words.length; i += 2) {
		if (!(/r$/.test(uk_words[i])) &&
			/r$/.test(us_words[i])) uk_words[i] += "r";
		var re = /r([^aeiouæɑɒɔəɛɪʊʌ])/g;
		var r;
		while ((r = re.exec(us_words[i])) != null) {
			var ri;
			if ((ri = uk_words[i].indexOf(r[1], r.index)) !== -1) {
				uk_words[i] = uk_words[i].slice(0, ri) + "r" + uk_words[i].slice(ri);
			}
		}
	}
	s = uk_words.join("");
	s = uk_words[0];
	for (var i = 2; i < uk_words.length; i += 2) {
		s += us_words[i - 1] + uk_words[i];
	}
	ipa_mix.value = s;

	var en_words = en.value.trim().replace(/['ʼ’]/g, "ˈ").split(/(\P{L}+)/gu);
	var mix_words = s.split(/(\P{L}+)/gu);
	if (en_words.length == mix_words.length) {
		for (var i = 0; i < en_words.length; i += 2) {
			if (en_words[i] == "") continue;
			if (en_words[i][0] != en_words[i][0].toLowerCase()) {
				mix_words[i] = mix_words[i][0].toUpperCase() + mix_words[i].slice(1);
			}
			if (en_words[i].slice(-1) == "ˈ") mix_words[i] += "ʼ";
			else if (en_words[i].slice(-2, -1) == "ˈ" ||
				en_words[i].slice(-3, -2) == "ˈ") {
				mix_words[i] = mix_words[i].slice(0, -1) + "ʼ" + mix_words[i].slice(-1);
			}
			else if (en_words[i][1] == "ˈ") {
				mix_words[i] = mix_words[i][0] + "ʼ" + mix_words[i].slice(1);
			}
		}
		s = mix_words.join("");
	}
	else {
		error.textContent = lang == "ja" ?
			"英語と IPA の 単語数が 一致しないので，正しく 変換されない 可能性が あります。" :
			"It may convert incorrectly because number of English and IPA words mismatch.";
	}

	for (var i = 0; i < ipa_common.length; i++) {
		s = s.replace(new RegExp(ipa_common[i][0], "gi"), m => m != m.toLowerCase() ?
			ipa_common[i][1][0].toUpperCase() + ipa_common[i][1].slice(1) : ipa_common[i][1]);
	}

	common.value = s.replace(/ː/g, "̄").normalize("NFC");
	for (var i = 0; i < common_kana.length; i++) {
		s = s.replace(new RegExp(common_kana[i][0], "giu"), common_kana[i][1]);
	}
	var s2 = s;
	for (var i = 0; i < common_katakana.length; i++) {
		s2 = s2.replace(new RegExp(common_katakana[i][0], "giu"), common_katakana[i][1]);
	}
	katakana.value = s2;
	s2 = s;
	for (var i = 0; i < common_hiragana.length; i++) {
		s2 = s2.replace(new RegExp(common_hiragana[i][0], "giu"), common_hiragana[i][1]);
	}
	hiragana.value = s2;
});